app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews"
---
    def index
        #get
        render json: Review.all

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        #get
        review = Review.find(params[:id])

INSERT INTO "reviews" ("user_id", "strain_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["strain_id", 3], ["description", "weasfvdsvadsf"], ["created_at", "2022-07-21 20:19:56.388979"], ["updated_at", "2022-07-21 20:19:56.388979"]]
---
    def create
        #post
        review = Review.create!(review_params)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]
---
    def destroy
        #delete
        review = Review.find(params[:id])
        review.destroy

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "description" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["description", "This is a test"], ["updated_at", "2022-07-21 20:22:32.696186"], ["id", 1]]
---
    def update
        #patch
        review = Review.find(params[:id])
        review.update!(update_review_params)