app/controllers/strains_controller.rb

    def index
        #get
        render json: Strain.all
---
SELECT "strains".* FROM "strains"

    def show
        #get
        strain = Strain.find(params[:id])
---
SELECT "strains".* FROM "strains" WHERE "strains"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        #post
        strain = Strain.create!(strain_params)
---
INSERT INTO "strains" ("strain_name", "image", "description", "flower_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"